# Lý thuyết

In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect('product.sqlite')

In [3]:
cursor = connection.cursor()

In [4]:
cursor.execute('''
    CREATE TABLE PRODUCT (
        NAME TEXT PRIMARY KEY,
        BRAND TEXT NOT NULL,
        PRICE INTEGER NOT NULL
    );
'''
)

In [5]:
cursor.execute('''
    INSERT INTO PRODUCT VALUES
    ('Nam', 'LV', 19000000), 
    ('Nu', 'Adidas', 2000000)
''')

In [6]:
connection.commit()

In [7]:
import pandas as pd

In [8]:
query = '''
SELECT SUM(price) AS total_revenue 
FROM PRODUCT 
'''

data_sum = pd.read_sql_query(query, connection)
print(data_sum)

   total_revenue
0       21000000

In [9]:
query = ''' 
SELECT NAME, MAX(price) AS PRICE
FROM PRODUCT;
'''

data_max = pd.read_sql_query(query, connection)
print(data_max)

  NAME     PRICE
0  Nam  19000000

In [10]:
query = '''
SELECT BRAND, SUM(price) AS total_revenue 
FROM PRODUCT 
GROUP BY BRAND;
'''

data_sum_by_brand = pd.read_sql_query(query, connection)
print(data_sum_by_brand)

    BRAND  total_revenue
0  Adidas        2000000
1      LV       19000000

In [11]:
query = '''
SELECT BRAND, MIN(price) AS PRICE 
FROM PRODUCT 
GROUP BY BRAND;
'''

data_min_by_brand = pd.read_sql_query(query, connection)
print(data_min_by_brand)

    BRAND     PRICE
0  Adidas   2000000
1      LV  19000000

# Bài tập

In [12]:
connection = sqlite3.connect('stock.sqlite')

In [13]:
cursor = connection.cursor()

In [14]:
cursor.execute('''
    CREATE TABLE STOCK (
        ID INTEGER PRIMARY KEY,
        NAME TEXT NOT NULL,
        BUY INTEGER NOT NULL, 
        INVESTOR TEXT NOT NULL
    );
''')

In [15]:
cursor.execute('''
    INSERT INTO STOCK 
    VALUES 
        (1, 'ACB', 29.45, 'Nguyen'), 
        (2, 'VIC', 44.55, 'Nguyen'), 
        (3, 'GMD', 74.30, 'Nguyen'), 
        (4, 'ACB', 28.45, 'Vinh'), 
        (5, 'VIC', 40.55, 'Vinh'), 
        (6, 'GMD', 60.30, 'Vinh')
''')

In [17]:
connection.commit()

In [16]:
query = ''' 
SELECT *
FROM STOCK;
'''

data_all = pd.read_sql_query(query, connection)
print(data_all)

   ID NAME    BUY INVESTOR
0   1  ACB  29.45   Nguyen
1   2  VIC  44.55   Nguyen
2   3  GMD  74.30   Nguyen
3   4  ACB  28.45     Vinh
4   5  VIC  40.55     Vinh
5   6  GMD  60.30     Vinh

In [20]:
query = ''' 
SELECT SUM(BUY) AS TONG_GIA_BAN
FROM STOCK
'''

data_sum = pd.read_sql_query(query, connection)
print(data_sum)

   TONG_GIA_BAN
0         277.6

In [23]:
query = ''' 
SELECT INVESTOR, MAX(BUY) AS MAX_PRICE
FROM STOCK
GROUP BY INVESTOR
'''

data_highest = pd.read_sql_query(query, connection)
print(data_highest)

  INVESTOR  MAX_PRICE
0   Nguyen       74.3
1     Vinh       60.3